# \u5fc5\u9808\u9805\u76ee
NotNull.gender={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.repGender={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.boardingClassCd={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.creditTypeCd={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.flightType={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.outwardFlight={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.homewardFlight={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
# \u5fc5\u9808\u9805\u76ee(API)
NotNull.flightSearchQuery.boardingClassCd={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.flightSearchQuery.flightType={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.passengerResource.gender={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.selectFlightResource.boardingClassCd={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.ticketReserveResource.repGender={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.ticketReserveResource.flightType={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NotNull.ticketReserveResource.repGender={0}\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
# \u534a\u89d2\u6570\u5b57\u5909\u63db
typeMismatch.java.lang.Integer={0}\u306f\u534a\u89d2\u6570\u5b57\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
# \u65e5\u4ed8\u5909\u63db
typeMismatch.java.util.Date={0}\u306b\u6b63\u3057\u3044\u65e5\u4ed8\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
# enum\u5909\u63db
typeMismatch.jp.co.ntt.atrs.domain.model.Gender={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
typeMismatch.jp.co.ntt.atrs.domain.model.BoardingClassCd={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
typeMismatch.jp.co.ntt.atrs.domain.model.FlightType={0}\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# A1 \u5171\u901a\u696d\u52d9/\u822a\u7a7a\u30c1\u30b1\u30c3\u30c8\u4e88\u7d04\u30b7\u30b9\u30c6\u30e0\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b
AbstractUserDetailsAuthenticationProvider.badCredentials=\u4f1a\u54e1\u756a\u53f7\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u5165\u529b\u60c5\u5831\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.a1.2001=\u4f1a\u54e1\u756a\u53f7\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u5165\u529b\u60c5\u5831\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002

# B1 \u30c1\u30b1\u30c3\u30c8\u4e88\u7d04\u30b5\u30fc\u30d3\u30b9/\u30d5\u30e9\u30a4\u30c8\u306e\u7a7a\u5e2d\u72b6\u6cc1\u3092\u7167\u4f1a\u3059\u308b
e.ar.b1.2001=\u7a7a\u5e2d\u7167\u4f1a\u5bfe\u8c61\u5916\u306e\u642d\u4e57\u65e5\u304c\u5165\u529b\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u5bfe\u8c61\u671f\u9593\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b1.2002=\u3054\u6307\u5b9a\u306e\u533a\u9593\u306f\u904b\u884c\u3057\u3066\u304a\u308a\u307e\u305b\u3093\u3002\u904b\u884c\u533a\u9593\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b1.2003=\u3054\u6307\u5b9a\u306e\u6761\u4ef6\u306b\u5408\u81f4\u3059\u308b\u30d5\u30e9\u30a4\u30c8\u306f\u3054\u3056\u3044\u307e\u305b\u3093\u3002
e.ar.b1.5001=\u51fa\u767a\u7a7a\u6e2f\u3068\u5230\u7740\u7a7a\u6e2f\u306b\u540c\u3058\u7a7a\u6e2f\u306f\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002\u533a\u9593\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b1.5002=\u5fa9\u8def\u642d\u4e57\u65e5\u306f\u5f80\u8def\u642d\u4e57\u65e5\u4ee5\u964d\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

# B2 \u30c1\u30b1\u30c3\u30c8\u4e88\u7d04\u30b5\u30fc\u30d3\u30b9/\u30c1\u30b1\u30c3\u30c8\u3092\u4e88\u7d04\u3059\u308b
e.ar.b2.2001=\u9078\u629e\u3055\u308c\u305f\u5fa9\u8def\u306e\u30d5\u30e9\u30a4\u30c8\u306f\u3054\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u5fa9\u8def\u306e\u30d5\u30e9\u30a4\u30c8\u306f\u5f80\u8def\u306e\u642d\u4e57\u6642\u523b\u3088\u308a2\u6642\u9593\u4ee5\u4e0a\u7d4c\u904e\u3057\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
e.ar.b2.2002=\u5165\u529b\u3055\u308c\u305f\u4ee3\u8868\u8005\u60c5\u5831\u306e\u4f1a\u54e1\u756a\u53f7\u304c\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u5165\u529b\u60c5\u5831\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b2.2003=\u5165\u529b\u3055\u308c\u305f\u4ee3\u8868\u8005\u60c5\u5831\u3068\u4f1a\u54e1\u756a\u53f7\u306b\u8a72\u5f53\u3059\u308b\u304a\u5ba2\u69d8\u60c5\u5831\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u5165\u529b\u60c5\u5831\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b2.2004=\u4e88\u7d04\u4ee3\u8868\u8005\u306e\u65b9\u306f{0}\u6b73\u4ee5\u4e0a\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
e.ar.b2.2005=\u5165\u529b\u3055\u308c\u305f[{0}]\u756a\u76ee\u306e\u4f1a\u54e1\u756a\u53f7\u304c\u78ba\u8a8d\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u5165\u529b\u60c5\u5831\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b2.2006=\u5165\u529b\u3055\u308c\u305f[{0}]\u756a\u76ee\u306e\u304a\u5ba2\u69d8\u60c5\u5831\u3068\u4f1a\u54e1\u756a\u53f7\u306b\u8a72\u5f53\u3059\u308b\u304a\u5ba2\u69d8\u60c5\u5831\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u5165\u529b\u60c5\u5831\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.b2.2007=\u904b\u8cc3\u7a2e\u5225\u306b\u300c\u30ec\u30c7\u30a3\u30fc\u30b9\u5272\u300d\u3092\u3054\u5229\u7528\u306e\u5834\u5408\u3001\u642d\u4e57\u8005\u306f\u5168\u3066\u5973\u6027\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
e.ar.b2.2008=\u4ee5\u4e0b\u306e\u30d5\u30e9\u30a4\u30c8\u304c\u4e88\u7d04\u53ef\u80fd\u6642\u671f\u3092\u6e80\u305f\u3057\u3066\u304a\u308a\u307e\u305b\u3093\u3002\u30d5\u30e9\u30a4\u30c8\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
e.ar.b2.2009=<h2>\u3054\u8ff7\u60d1\u3092\u304a\u304b\u3051\u3057\u3066\u7533\u3057\u8a33\u3042\u308a\u307e\u305b\u3093\u3002</h2><p>\u4ee5\u4e0b\u306e\u30d5\u30e9\u30a4\u30c8\u306e\u5ea7\u5e2d\u304c\u78ba\u4fdd\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002<br>\u304a\u624b\u6570\u3067\u3059\u304c\u3001\u518d\u5ea6\u30d5\u30e9\u30a4\u30c8\u306e\u9078\u629e\u3092\u884c\u3063\u3066\u304f\u3060\u3055\u3044\u3002</p>
e.ar.b2.2010=\u9078\u629e\u3055\u308c\u305f\u904b\u8cc3\u7a2e\u5225\u306e\u6700\u5c11\u4eba\u6570\u3092\u6e80\u305f\u3057\u3066\u304a\u308a\u307e\u305b\u3093\u3002\u904b\u8cc3\u7a2e\u5225\u300c{0}\u300d\u306f{1}\u540d\u304b\u3089\u3054\u5229\u7528\u306b\u306a\u308c\u307e\u3059\u3002
e.ar.b2.5001=\u5f80\u8def\u307e\u305f\u306f\u5fa9\u8def\u306e\u30d5\u30e9\u30a4\u30c8\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
e.ar.b2.5002=\u304a\u5ba2\u69d8\u60c5\u5831\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
e.ar.b2.5003={0}\u3068{1} \u306e\u5408\u8a08\u6587\u5b57\u6570\u306f {2}\uff5e{3}\u6587\u5b57\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002

# C0 ATRS\u30ab\u30fc\u30c9\u4f1a\u54e1\u30b5\u30fc\u30d3\u30b9
e.ar.c0.5001=\u518d\u5165\u529b\u3055\u308c\u305fE\u30e1\u30fc\u30eb\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u5165\u529b\u5185\u5bb9\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.c0.5002=\u5e02\u5916\u5c40\u756a\u3068\u5e02\u5185\u5c40\u756a\u306e\u5408\u8a08\u6841\u6570\u304c6\uff5e7\u6841\u306e\u7bc4\u56f2\u5916\u3067\u3059\u3002\u5165\u529b\u5185\u5bb9\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.c0.5003=\u751f\u5e74\u6708\u65e5\u306f{0}\u304b\u3089{1}\u307e\u3067\u306e\u671f\u9593\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# C1 ATRS\u30ab\u30fc\u30c9\u4f1a\u54e1\u30b5\u30fc\u30d3\u30b9/ATRS\u30ab\u30fc\u30c9\u4f1a\u54e1\u306b\u5165\u4f1a\u3059\u308b
e.ar.c1.5001=\u518d\u5165\u529b\u3055\u308c\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u5165\u529b\u5185\u5bb9\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002

# C2 ATRS\u30ab\u30fc\u30c9\u4f1a\u54e1\u30b5\u30fc\u30d3\u30b9/ATRS\u30ab\u30fc\u30c9\u4f1a\u54e1\u60c5\u5831\u3092\u5909\u66f4\u3059\u308b
e.ar.c2.2001=\u5165\u529b\u3055\u308c\u305f\u73fe\u5728\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u6b63\u3057\u3044\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
e.ar.c2.5001=\u518d\u5165\u529b\u3055\u308c\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u5165\u529b\u5185\u5bb9\u3092\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002
e.ar.c2.5002=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3059\u308b\u5834\u5408\u306f\u73fe\u5728\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u5909\u66f4\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u518d\u5165\u529b\u3092\u5168\u3066\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
i.ar.c2.2001=\u4f1a\u54e1\u60c5\u5831\u3092\u66f4\u65b0\u3057\u307e\u3057\u305f\u3002

# \u5171\u901a\u30e1\u30c3\u30bb\u30fc\u30b8
e.ar.fw.0001=\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u77db\u76fe\u3057\u3066\u3044\u307e\u3059\u3002
e.ar.fw.0002=\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
e.ar.fw.0003=400:\u4e0d\u6b63\u306a\u30ea\u30af\u30a8\u30b9\u30c8\u3067\u3059\u3002
e.ar.fw.0004=403:\u4e0d\u6b63\u306a\u30a2\u30af\u30bb\u30b9\u3067\u3059\u3002
e.ar.fw.0005=404:Web\u30da\u30fc\u30b8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
e.ar.fw.8001=\u696d\u52d9\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
e.ar.fw.9999=<h2>\u3054\u8ff7\u60d1\u3092\u304a\u304b\u3051\u3057\u3066\u7533\u3057\u8a33\u3042\u308a\u307e\u305b\u3093\u3002</h2><p>\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002<br>\u304a\u624b\u6570\u3067\u3059\u304c\u3001\u3057\u3070\u3089\u304f\u6642\u9593\u3092\u304a\u3044\u3066\u304b\u3089\u518d\u30a2\u30af\u30bb\u30b9\u3059\u308b\u304b\u3001\u304a\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002</p>
